# St7DeleteUCS

Deletes the specified UCS in a Strand7 model.

long St7DeleteUCS(long uID, long UCSId)
Input Parameters
uID
Strand7 model file ID.
UCSId
ID number of the specified UCS. UCSId = 1 refers to the global XYZ system, which cannot be deleted.